/** * 测试数据 * @type {arry} */ /*2026-05-14 06:54:33*/
// url 调用 http://fund.eastmoney.com/pingzhongdata/018125.js
var ishb = false;
/*基金或股票信息*/ var fS_name = "永赢先进制造智选混合发起C";
var fS_code = "018125";
/*原费率*/ var fund_sourceRate = "0.00";
/*现费率*/ var fund_Rate = "0.00";
/*最小申购金额*/ var fund_minsg = "10";
/*基金持仓股票代码*/ var stockCodes = [
  "6031791",
  "3015500",
  "00179116",
  "0020480",
  "6036671",
  "3009530",
  "6030091",
  "6016891",
  "6031191",
  "0020500",
];
/*基金持仓债券代码*/ var zqCodes = "0197921,0197851";
/*基金持仓股票代码(新市场号)*/ var stockCodesNew = [
  "1.603179",
  "0.301550",
  "116.00179",
  "0.002048",
  "1.603667",
  "0.300953",
  "1.603009",
  "1.601689",
  "1.603119",
  "0.002050",
];
/*基金持仓债券代码（新市场号）*/ var zqCodesNew = "1.019792,1.019785";
/*收益率*/ /*近一年收益率*/ var syl_1n = "22.88";
/*近6月收益率*/ var syl_6y = "17.59";
/*近三月收益率*/ var syl_3y = "-4.27";
/*近一月收益率*/ var syl_1y = "12.48";
/*股票仓位测算图*/ var Data_fundSharesPositions = [
  [1776096000000, 86.09],
  [1776182400000, 90.61],
  [1776268800000, 91.4],
  [1776355200000, 91.08],
  [1776614400000, 91.08],
  [1776700800000, 90.41],
  [1776787200000, 90.41],
  [1776873600000, 90.41],
  [1776960000000, 90.41],
  [1777219200000, 91.32],
  [1777305600000, 87.11],
  [1777392000000, 83.2],
  [1777478400000, 83.2],
  [1777996800000, 83.2],
  [1778083200000, 80.27],
  [1778169600000, 88.94],
  [1778428800000, 88.94],
  [1778515200000, 88.94],
];
/*单位净值走势 equityReturn-净值回报 unitMoney-每份派送金*/ var Data_netWorthTrend =
  [
    { x: 1683129600000, y: 1.0, equityReturn: 0, unitMoney: "" },
    { x: 1683216000000, y: 0.9998, equityReturn: -0.02, unitMoney: "" },
    { x: 1683820800000, y: 0.9937, equityReturn: 0, unitMoney: "" },
    { x: 1684425600000, y: 1.0414, equityReturn: 0, unitMoney: "" },
    { x: 1684684800000, y: 1.0546, equityReturn: 1.27, unitMoney: "" },
    { x: 1684771200000, y: 1.0442, equityReturn: -0.99, unitMoney: "" },
    { x: 1684857600000, y: 1.046, equityReturn: 0.17, unitMoney: "" },
    //...
    { x: 1778083200000, y: 2.3902, equityReturn: 6.39, unitMoney: "" },
    { x: 1778169600000, y: 2.4645, equityReturn: 3.11, unitMoney: "" },
    { x: 1778428800000, y: 2.4627, equityReturn: -0.07, unitMoney: "" },
    { x: 1778515200000, y: 2.4617, equityReturn: -0.04, unitMoney: "" },
    { x: 1778601600000, y: 2.4634, equityReturn: 0.07, unitMoney: "" },
  ];
/*累计净值走势*/ var Data_ACWorthTrend = [
  [1683129600000, 1.0],
  [1683216000000, 0.9998],
  [1683820800000, 0.9937],
  [1684425600000, 1.0414],
  [1684684800000, 1.0546],
  [1684771200000, 1.0442],
  // ...
  [1778169600000, 2.4645],
  [1778428800000, 2.4627],
  [1778515200000, 2.4617],
  [1778601600000, 2.4634],
];
/*累计收益率走势*/ var Data_grandTotal = [
  {
    name: "永赢先进制造智选混合发",
    data: [
      [1762963200000, 0],
      [1763049600000, -1.46],
      [1763308800000, -0.66],
      [1763395200000, -1.9],
      [1763481600000, -2.74],
      [1763568000000, -4.05],
      [1763654400000, -3.58],
      // ...
      [1778083200000, 14.1],
      [1778169600000, 17.64],
      [1778428800000, 17.56],
      [1778515200000, 17.51],
      [1778601600000, 17.59],
    ],
  },
  {
    name: "同类平均",
    data: [
      [1762963200000, 0],
      [1763049600000, -1.6],
      [1763308800000, -2.02],
      [1763395200000, -3.02],
      [1763481600000, -3.08],
      //...
      [1778169600000, 12.24],
      [1778428800000, 13.89],
      [1778515200000, 13.82],
      [1778601600000, 14.99],
    ],
  },
  {
    name: "沪深300",
    data: [
      [1762963200000, 0],
      [1763049600000, -1.57],
      [1763308800000, -2.21],
      [1763395200000, -2.85],
      [1763481600000, -2.42],
      // ...
      [1778515200000, 5.23],
      [1778601600000, 6.3],
    ],
  },
];
/*同类排名走势*/ var Data_rateInSimilarType = [
  { x: 1691078400000, y: 29, sc: "3787" },
  { x: 1691337600000, y: 37, sc: "3748" },
  { x: 1691424000000, y: 36, sc: "3747" },
  { x: 1691510400000, y: 57, sc: "3746" },
  // ...
  { x: 1777478400000, y: 5025, sc: "5136" },
  { x: 1777996800000, y: 5035, sc: "5121" },
  { x: 1778083200000, y: 4782, sc: "5119" },
  { x: 1778169600000, y: 4538, sc: "5147" },
  { x: 1778428800000, y: 4286, sc: "5143" },
  { x: 1778515200000, y: 4391, sc: "5148" },
  { x: 1778601600000, y: 4435, sc: "5149" },
];
/*同类排名百分比*/ var Data_rateInSimilarPersent = [
  [1691078400000, 99.23],
  [1691337600000, 99.01],
  [1691424000000, 99.04],
  [1691510400000, 98.48],
  // ...
  [1776268800000, 1.01],
  [1776355200000, 1.06],
  [1776614400000, 0.73],
  [1776700800000, 0.51],
  [1776787200000, 0.28],
  [1776873600000, 0.32],
  [1776960000000, 0.35],
  [1777219200000, 0.96],
  [1777305600000, 1.55],
  [1777392000000, 2.39],
  [1777478400000, 2.16],
  [1777996800000, 1.68],
  [1778083200000, 6.58],
  [1778169600000, 11.83],
  [1778428800000, 16.66],
  [1778515200000, 14.7],
  [1778601600000, 13.87],
];
/*规模变动 mom-较上期环比*/ var Data_fluctuationScale = {
  categories: [
    "2025-03-31",
    "2025-06-30",
    "2025-09-30",
    "2025-12-31",
    "2026-03-31",
  ],
  series: [
    { y: 84.77, mom: "447.46%" },
    { y: 108.69, mom: "28.21%" },
    { y: 154.81, mom: "42.43%" },
    { y: 154.71, mom: "-0.07%" },
    { y: 126.2, mom: "-18.43%" },
  ],
};
/*持有人结构*/ var Data_holderStructure = {
  series: [
    { name: "机构持有比例", data: [19.1167, 10.1771, 4.6261, 11.1562] },
    { name: "个人持有比例", data: [80.8833, 89.8229, 95.3739, 88.8438] },
    { name: "内部持有比例", data: [0.03, 0.01, 0.0, 0.01] },
  ],
  categories: ["2024-06-30", "2024-12-31", "2025-06-30", "2025-12-31"],
};
/*资产配置*/ var Data_assetAllocation = {
  series: [
    {
      name: "股票占净比",
      type: null,
      data: [94.46, 94.84, 94.82, 90.41],
      yAxis: 0,
    },
    {
      name: "债券占净比",
      type: null,
      data: [0.16, 1.75, 2.61, 1.81],
      yAxis: 0,
    },
    {
      name: "现金占净比",
      type: null,
      data: [5.37, 4.18, 2.91, 8.02],
      yAxis: 0,
    },
    {
      name: "净资产",
      type: "line",
      data: [138.4485, 201.7784, 194.624, 157.0197],
      yAxis: 1,
    },
  ],
  categories: ["2025-06-30", "2025-09-30", "2025-12-31", "2026-03-31"],
};
/*业绩评价 ['选股能力', '收益率', '抗风险', '稳定性','择时能力']*/ var Data_performanceEvaluation =
  {
    avr: "66.25",
    categories: ["选证能力", "收益率", "抗风险", "稳定性", "择时能力"],
    dsc: [
      "反映基金挑选证券而实现风险\u003cbr\u003e调整后获得超额收益的能力",
      "根据阶段收益评分，反映基金的盈利能力",
      "反映基金投资收益的回撤情况",
      "反映基金投资收益的波动性",
      "反映基金根据对市场走势的判断，\u003cbr\u003e通过调整仓位及配置而跑赢基金业\u003cbr\u003e绩基准的能力",
    ],
    data: [70.0, 70.0, 55.0, 55.0, 75.0],
  };
/*现任基金经理*/ var Data_currentFundManager = [
  {
    id: "30677373",
    pic: "https://pdf.dfcfw.com/pdf/H8_30677373_1.PNG",
    name: "张璐",
    star: 4,
    workTime: "5年又71天",
    fundSize: "356.06亿(8只基金)",
    power: {
      avr: "72.86",
      categories: ["经验值", "收益率", "抗风险", "稳定性", "择时能力"],
      dsc: [
        "反映基金经理从业年限和管理基金的经验",
        "根据基金经理投资的阶段收益评分，反映\u003cbr\u003e基金经理投资的盈利能力",
        "反映基金经理投资的回撤控制能力",
        "反映基金经理投资收益的波动",
        "反映基金经理根据对市场的判断，通过\u003cbr\u003e调整仓位及配置而跑赢业绩的基准能力",
      ],
      data: [81.4, 87.2, 54.1, 51.9, 69.7],
      jzrq: "2026-05-13",
    },
    profit: {
      categories: ["任期收益", "同类平均", "沪深300"],
      series: [
        {
          data: [
            { name: null, color: "#7cb5ec", y: 146.34 },
            { name: null, color: "#414c7b", y: 33.35 },
            { name: null, color: "#f7a35c", y: 24.02 },
          ],
        },
      ],
      jzrq: "2026-05-13",
    },
  },
];
/*申购赎回*/ var Data_buySedemption = {
  series: [
    { name: "期间申购", data: [90.43, 104.98, 71.75, 71.06] },
    { name: "期间赎回", data: [75.53, 103.14, 70.54, 73.89] },
    { name: "总份额", data: [59.24, 61.07, 62.29, 59.46] },
  ],
  categories: ["2025-06-30", "2025-09-30", "2025-12-31", "2026-03-31"],
};
/*同类型基金涨幅榜（页面底部通栏）*/ var swithSameType = [
  [
    "016370_信澳业绩驱动混合A_374.85",
    "016371_信澳业绩驱动混合C_372.06",
    "022364_永赢科技智选混合发起_344.33",
    "022365_永赢科技智选混合发起_341.69",
    "008528_华泰柏瑞质量成长A_340.86",
  ],
  [
    "016370_信澳业绩驱动混合A_477.66",
    "016371_信澳业绩驱动混合C_470.83",
    "018956_中航机遇领航混合发起_404.02",
    "018957_中航机遇领航混合发起_398.00",
    "011369_华商均衡成长混合A_395.81",
  ],
  [
    "008988_大成科技创新混合A_339.37",
    "008989_大成科技创新混合C_334.14",
    "016370_信澳业绩驱动混合A_310.45",
    "016371_信澳业绩驱动混合C_303.14",
    "017102_大摩数字经济混合A_300.98",
  ],
  [
    "006533_易方达科融混合_308.94",
    "001513_易方达信息产业混合A_285.91",
    "010115_易方达远见成长混合A_282.40",
    "011412_易方达远见成长混合C_274.79",
    "011369_华商均衡成长混合A_270.67",
  ],
  [
    "016873_广发远见智选混合A_116.13",
    "016874_广发远见智选混合C_115.75",
    "026210_平安科技精选混合发起_93.54",
    "026211_平安科技精选混合发起_93.23",
    "024459_华商致远回报混合A_90.55",
  ],
];
